cases/compressible/omega_same/solidBodyAMI/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./initialConditions"

dimensions      [0 2 -2 0 0 0 0];

Ux              #calc "$mach * sqrt($gamma*$Rair*$Tref)*cos(degToRad($alpha))";
Uz              #calc "$mach * sqrt($gamma*$Rair*$Tref)*sin(degToRad($alpha))";
Umag            #calc "sqrt($Ux*$Ux + $Uz*$Uz)";

kInlet          #calc"0.00001 * $Umag * $Umag / ($rhoVal * $Umag * $chord / $muVal)";

internalField   uniform $kInlet;

boundaryField
{
    aerofoil
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform $kInlet;
        value           uniform $kInlet;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $kInlet;
        value           uniform $kInlet;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    masterAMI
    {
        type            cyclicAMI;
        value           $internalField;
    }
    slaveAMI
    {
        type            cyclicAMI;
        value           $internalField;
    }
}

// ************************************************************************* //
