cases/compressible/omega_same/solidBodyAMI/system/functions/residuals
residuals
{
     type            residuals;
     libs            ("libutilityFunctionObjects.so");

     writeControl    adjustableRunTime;
     writeInterval   1e-2;

     fields (p U h k omega);
}
